Dhatri-2001/PIC18F4550/PIC18F4550/CLCD.X/clcd.c
#include <xc.h>
#include "LCD.h"
#include "push_buttons.h"
extern unsigned int bit_mode;

static void clcd_write(unsigned char byte, unsigned char mode) {
    CLCD_RS = mode;
    if (bit_mode == LOW) {
        CLCD_DATA_PORT = byte & 0xF0;
        CLCD_EN = HI;
        __delay_us(100);
        CLCD_EN = LOW;

        CLCD_DATA_PORT = (byte & 0x0F) << 4;
    } else if (bit_mode == HI) {
        CLCD_DATA_PORT = byte;
    }
    CLCD_EN = HI;
    __delay_us(100);
    CLCD_EN = LOW;

    __delay_us(4100);
}

static void init_display_controller(void) {
    // if RB0 == 0; then switch is pressed and hence consider LCD as 8-bit mode
    // if RB1 ==0; then consider as 4-bit mode

    if (bit_mode == LOW) {
        // 4bit mode
        /* Startup Time for the CLCD controller */
        __delay_ms(30);

        /* The CLCD Startup Sequence */
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(4100);
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(100);
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(1);
        clcd_4_bit_mode();
    } else if (bit_mode == HI) {
        /* Startup Time for the CLCD controller */
        __delay_ms(30);

        /* The CLCD Startup Sequence */
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(4100);
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(100);
        clcd_write(EIGHT_BIT_MODE, INST_MODE);
        __delay_us(1);

    }
    clcd_write(TWO_LINES_5x8_4_BIT_MODE, INST_MODE);
    __delay_us(100);
    clcd_write(CLCD_CLEAR_SCREEN, INST_MODE);
    __delay_us(500);
    clcd_write(CLCD_CURSOR_OFF, INST_MODE);
    __delay_us(100);

}

void clcd_4_bit_mode(void) {
    clcd_write(FOUR_BIT_MODE, INST_MODE);
    __delay_us(100);
}

void init_clcd(void) {
    /* Setting the CLCD Data Port as Output */
    CLCD_DATA_PORT_DDR = 0x00;

    /* Setting the RS and EN lines as Output */
    CLCD_RS_DDR = 0;
    CLCD_EN_DDR = 0;
}

void clcd_putch(const char data, unsigned char addr) {
    clcd_write(addr, INST_MODE);
    clcd_write(data, DATA_MODE);
}

void clcd_print(const char *str, unsigned char addr) {
    clcd_write(addr, INST_MODE);

    while (*str != '\0') {
        clcd_write(*str, DATA_MODE);
        str++;
    }
}

void display_controller(void)
{
    init_display_controller();
}